In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.datasets import fetch_california_housing

In [15]:
df = pd.read_csv("insurance.csv")

In [16]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [17]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [31]:
df.columns(dtype="object")

TypeError: 'Index' object is not callable

In [27]:
def one_hot(df):
    for i in lst:
        if df[i].nunique() == 2:
            df[df[i] == df[i].unique()[0]] = 0
            df[df[i] == df[i].unique()[1]] = 1
        else:
            print("This is not")

In [28]:
df.region.nunique() == 2

False

In [29]:
one_hot(df)

This is not

In [30]:
df.head()

   age sex  bmi  children smoker region  charges
0    0   0  0.0         0      0      0      0.0
1    1   1  1.0         1      1      1      1.0
2    1   1  1.0         1      1      1      1.0
3    1   1  1.0         1      1      1      1.0
4    1   1  1.0         1      1      1      1.0